{
    "url": "https://www.consumerfinance.gov/ask-cfpb/am-i-allowed-to-negotiate-the-terms-and-costs-of-my-mortgage-at-closing-en-1919/",
    "topic": "Mortgages",
    "title": "Am I allowed to negotiate the terms and costs of my mortgage at closing?",
    "last_reviewed": "SEP 11, 2024",
    "language": "English",
    "main_content": "It’s usually easier to negotiate the fees charged by your lender than it is to negotiate third-party fees.You should always ask questions about fees and rates throughout the whole process. You can ask the settlement officer, lender or closing attorney. Ask about anything that you don’t understand. This is particularly the case with fees and rates. You should know why you are paying everything you are paying. Make sure you take a list with phone numbers of all of the people involved with your closing (settlement officer, loan officer, closing attorney, real estate agent) in case you have any questions at any time during the closing process.Here are some tips to think about to help review lender fees:Ask for a justification for each lender-charged fee.If the lender charges an underwriting fee as well as a processing fee, ask for details of those services. You may find a fee that can be waived or reduced.Recognize that some items can’t be negotiated. The following items are imposed by governmental authorities:TaxesCity and county stampsRecording feesOther items are paid to third parties, and may be more difficult to negotiate. These are fees the lender has paid for, usually at a set price.Appraisal feeCredit report feeTax service feesFlood certification feesYour lender may also require that you make payments into the escrow account to build up a reserve and cover future payments of taxes and insurance.  Tip: The best way to get a good deal on a mortgage that’s right for you is to shop around well before you get to the closing table. Learn more about how to shop for a mortgage.If you have a problem with your mortgage closing process, you should discuss the problem with your lender. You can also submit a complaint to the CFPB online or by calling (855) 411-CFPB (2372). We’ll forward your complaint to the lender and work to get you a response, generally in 15 days.",
    "key_message": "Yes. You can always negotiate the terms of the mortgage loan up until you sign on the dotted line. However, your lender or the seller can refuse to agree to any changes."
}