{
    "url": "https://www.consumerfinance.gov/ask-cfpb/are-there-fees-to-use-a-payroll-card-en-403/",
    "topic": "Prepaid cards and other prepaid accounts",
    "title": "Are there fees to use a payroll card?",
    "last_reviewed": "OCT 31, 2024",
    "language": "English",
    "main_content": "Some employers pay employees their wages or salary on payroll cards. An employer contracts with a financial institution for the terms of the prepaid payroll card, including any fees that may be charged to you.Under the law, your employer can’t require you to receive your wages on a payroll card. Instead, they have to offer you at least one alternative, such as direct deposit to your bank account or payment by check, and allow you to choose.Along with the card, you’re required to receive certain disclosures that describe the fees and a cardholder agreement, which sets out the additional terms and conditions of the payroll card program. Like other prepaid cards, you’re not typically charged a monthly fee but you may incur other fees, such as for ATM withdrawals or if the card isn’t used for a certain period of time.Many state laws require that you’re able to access or withdraw your money for free, so check your state’s laws. The CFPB’s prepaid rule also requires providers to give you the disclosures before you choose to be paid through a payroll card. The disclosures include a “short form” that includes key fees and other important information and a “long form” that includes all fees and other information about the card. Learn how to read the disclosures to understand the fees.Before you agree to use a payroll cardRead these disclosures and the cardholder agreement. Think about how you will use the card and look at all the fees that may apply.Compare the fees and features to other payroll options. For example, look at options such as direct depositing your wages to a checking account or choosing a different prepaid with lower fees.If you have problems with a payroll card, you may file an online complaint to the CFPB, or by calling (855) 411-2372.",
    "key_message": "Most prepaid payroll cards charge fees to use certain card features. Before you agree to receive your wages on a payroll card, read the disclosures to understand the fees and other terms."
}