{
    "url": "https://www.consumerfinance.gov/ask-cfpb/as-a-servicemember-am-i-protected-from-foreclosure-en-306/",
    "topic": "Mortgages",
    "title": "As a servicemember, am I protected against foreclosure?",
    "last_reviewed": "MAY 31, 2023",
    "language": "English",
    "main_content": "If you took out a mortgage before entering active-duty military service (also known as a “pre-service mortgage obligation”), you generally can’t be foreclosed on without a valid court order while you are on active duty and for an additional 12 months after leaving active duty. This protection applies whether or not you told your mortgage lender or servicer about your military status.The SCRA also provides servicemembers with protections against default judgments, which are rulings against a party to a lawsuit because they didn’t appear in court. This includes foreclosure cases before a judge.If you obtained a mortgage before you went on active duty, you can ask for a mortgage interest rate reduction to 6 percent (including service charges and fees) for the entire time you are on active duty, and for an additional year after you leave active duty. Learn more about the SCRA interest rate protections.Learn more about whether you’re covered by the SCRA.If you still have questions about your rights under the SCRA, contact your closest legal assistance (JAG) office  for more information. You also may be able to get assistance from your state attorney general .Submit a complaint with the CFPBIf you believe a lender has discriminated against you for any reason, you can submit a complaint with the CFPB online or by calling (855) 411-CFPB (2372). You’ll need the dates, amounts, and other details about your complaint before submitting. We’ll provide you a way to monitor the status and progress of your complaint.",
    "key_message": "If you are in military service, the Servicemembers Civil Relief Act (SCRA) provides certain protections when it comes to issues related to mortgages and housing."
}