{
    "url": "https://www.consumerfinance.gov/ask-cfpb/at-the-mortgage-loan-closing-do-i-have-to-sign-if-i-dont-like-the-terms-en-185/",
    "topic": "Mortgages",
    "title": "At the mortgage loan closing, do I have to sign if I don't like the terms?",
    "last_reviewed": "JAN 14, 2025",
    "language": "English",
    "main_content": "Tip\n\tIf you are in the process of refinancing your existing mortgage, you don't have any contractual obligation to sign the documents.\n\n    \n    \n\n    \n    \n    \n        Warning: You should never sign anything that you don't understand. Don't sign if you don't understand the mortgage terms or if you think that you won't be able to pay back the loan.If you are borrowing money to buy a home, you likely have a contract with the seller. The contract may limit the amount of time and flexibility you have to close the sale. The contract may also subject you to legal action if you break it.If there are errors on the loan documents, or things that were added to the loan estimate or the closing disclosure which you should have received prior to your closing, you may be able to have those corrected at the closing. It is usually in everyone’s best interest to ensure the closing can proceed.However, if you choose to walk away, you may also have options. Review your contract or seek the advice of an attorney to determine what options you have if you decide not to take the home loan offered for the closing. You may be able to secure a new mortgage or extend the period to close the sale. However, if you can't do so, you may lose the deposit you paid to the seller when you entered into an agreement to buy their home. The seller may have other legal rights against you.If you have a contract with the seller, review the “mortgage contingency clause” in your sales contract, also known as the financing or loan contingency clause. This will tell you whether your deposit will be refunded if the sale is cancelled because you are unable to get a loan.",
    "key_message": "You don’t have to sign anything unless you're satisfied with the terms. However, you may be able to make corrections to the terms instead of walking away."
}