{
    "url": "https://www.consumerfinance.gov/ask-cfpb/can-i-use-a-reverse-mortgage-loan-to-buy-a-home-en-238/",
    "topic": "Reverse mortgages",
    "title": "Can I use a reverse mortgage loan to buy a home?",
    "last_reviewed": "JUL 11, 2022",
    "language": "English",
    "main_content": "A “HECM for Purchase” loan requires that you be 62 years of age or older and that the home you are purchasing be your principal residence. You will need to have cash available for the down payment. There will also be closing costs, which will be higher than those with other reverse mortgage loans. Some of these closing costs may be paid by the seller (depending on your state’s laws), so it is a good idea to shop around and talk to multiple lenders after speaking with your reverse mortgage housing counselor .  For HECM for Purchase loans you’ll need cash to pay the difference between the HECM proceeds and the sales price plus any closing costs.  Like all reverse mortgage loans, you will not have to make monthly payments on the HECM for Purchase loan. You will still need to fulfill the reverse mortgage requirements, such as living in the home as your principal residence, keeping the home in good condition, and paying your property taxes and homeowners/flood insurance premiums on time. Note: Not all properties are eligible for the HECM for Purchase loan program. For example, cooperative units and some manufactured homes are ineligible for the HECM for Purchase loan program.  Your right to cancel a reverse mortgageWith most reverse mortgages, you have three business days after closing to cancel the deal for any reason, without penalty. This is known as your right of “rescission.” To cancel, you must notify the lender in writing. Send your letter by certified mail, and ask for a return receipt so that you have documentation of when you sent and when the lender received your cancellation notice. Keep copies of any communications between you and your lender. After you cancel, the lender has 20 days to return any money you’ve paid for the financing of the reverse mortgage loan. If you believe there is a reason to cancel the loan after the three-day period, seek legal help to see if you have the right to cancel.Note: This information only applies to Home Equity Conversion Mortgages (HECMs), which are the most common type of reverse mortgage loan.",
    "key_message": "Yes. There is a “Home Equity Conversion Mortgage (HECM) for Purchase” loan that allows people 62 and older to purchase a new principal residence with HECM loan proceeds."
}