{
    "url": "https://www.consumerfinance.gov/ask-cfpb/can-a-debt-collector-try-to-collect-on-a-debt-that-was-discharged-in-bankruptcy-en-1425/",
    "topic": "Debt Collection",
    "title": "Can a debt collector try to collect on a debt that was discharged in bankruptcy?",
    "last_reviewed": "AUG 24, 2022",
    "language": "English",
    "main_content": "If a debt collector calls and you have filed for bankruptcy, tell the debt collector. You should also be sure the debt is in your list of debts and creditors filed with the bankruptcy court. If you are represented by an attorney for your bankruptcy, you should let the debt collector know this. Then the debt collector must contact the attorney instead of you while the bankruptcy is pending. You should also let your attorney know that you have been contacted by a debt collector. Once the debt is discharged by the bankruptcy court, the discharge permanently bars the creditor or debt collector from collection of the debt. Filing for bankruptcy can have long-term consequences so consult a bankruptcy attorney to learn more.It is important to recognize that lenders often have a right to repossess the collateral. For example, auto loan lenders generally have a right to repossess the vehicle after default. If so, then the lender may still have that right after the bankruptcy discharge, if that debt is unpaid. If you have a bankruptcy lawyer, you might want to get advice from your lawyer about repossession. We have prepared sample letters that a consumer could use to respond to a debt collector who is trying to collect a debt that you no longer owe due to a bankruptcy discharge. Additionally, the sample letters may help you to get information, stop or limit any further communication, or protect some of your rights.",
    "key_message": "Debt collectors cannot try to collect on debts that were discharged in bankruptcy. Also, if you file for bankruptcy, debt collectors are not allowed to continue collection activities while the bankruptcy case is pending in court."
}