{
    "url": "https://www.consumerfinance.gov/ask-cfpb/can-a-debt-collector-contact-me-about-a-deceased-relatives-debts-en-1469/",
    "topic": "Debt Collection",
    "title": "Can a debt collector contact me about a deceased relative’s debts?",
    "last_reviewed": "OCT 19, 2023",
    "language": "English",
    "main_content": "When someone dies with an unpaid debt, it should be paid from any money or property they left behind, according to state law. This is called their estate. If there is no money or property left in an estate, or the estate can’t pay, then the debt generally goes unpaid. For example, when state law requires the estate to pay survivors first, there might not be any money left over to pay debts.\n  \t\n    \n  \t\n  \t\t  \n    \t\t    For relatives who are not executors or administrators of the estate\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        You do not have to take responsibility for debts owed by a deceased person. You do not need to pay their debt, unless one of the situations below describes you:You are a co-signer on the person’s loanYou are a joint account holder on a credit card (not just an “authorized user” on the account)You are the spouse of the person, and your state law requires a spouse to pay the debtDebt collectors can contact you to try and locate the executor or administrator of the estate, but they should not discuss or mention the debt to you. You might want to tell the debt collector who the executor is. Debt collectors cannot use unfair, deceptive, or abusive practices to get you to take responsibility for a debt.\n    \n    \n    \n    \n\n                \n    \t\t    \n  \t\t  \n    \n  \t\t  \n    \t\t    For relatives who are acting as the estate’s executor or administrator\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        If you are the executor or administrator of the deceased person’s estate, debt collectors can contact you to discuss the deceased person's debts. Debt collectors are not allowed to say or hint that you are responsible for paying the debts with your own money.\n    \n    \n    \n    \n\n                \n    \t\t    \n  \t\t  \n    \n  \t\t  \n    \t\t    You have the right to tell a debt collector to stop contacting you\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        See additional resources about your rights in dealing with debt collection.",
    "key_message": "Generally, no one else has to pay back debts for a person who has died. There are some exceptions that vary by state."
}