{
    "url": "https://www.consumerfinance.gov/ask-cfpb/can-a-debt-collector-contact-me-about-a-debt-after-a-divorce-en-1413/",
    "topic": "Debt Collection",
    "title": "Can a debt collector contact me about a debt after a divorce?",
    "last_reviewed": "APR 14, 2023",
    "language": "English",
    "main_content": "Divorce changes the relationship between spouses, but it doesn’t automatically change their relationship with creditors. A divorce decree or property settlement may allocate debts to a specific spouse, but it doesn’t change the fact that a creditor can still collect from anyone whose name appears as a borrower on the loan or debt.While state laws vary, you are generally responsible for a debt unless you were contractually released by the creditor or your former spouse refinanced the loan and removed your name. This applies to any loans or debts you owed jointly with your former spouse, such as auto loans, mortgage loans, personal loans, medical bills, or utilities.For credit cards, you’re responsible for the debt if you had a joint credit card account, but if you were only an “authorized user” on your former spouse’s account, you’re generally not responsible for the amount owed. Learn how to be removed or have someone removed from the joint credit card account.Keep in mind, taking your name off a home or vehicle title doesn’t take your name off the mortgage or auto loan and sending creditors a copy of your divorce decree doesn’t end your responsibility on a joint account. If your divorce decree provided that your former spouse was responsible for the debt, or if you have other questions about your responsibility for a debt incurred before or during your marriage, contact your divorce attorney for advice or find an attorney in your state.If you're having trouble with debt collection, you can submit a complaint with the CFPB.",
    "key_message": "A debt collector can generally contact you about a debt if your name is still on the debt or loan agreement, or if you’re otherwise still legally responsible for it. Check your state law and original loan or credit agreement."
}