{
    "url": "https://www.consumerfinance.gov/ask-cfpb/can-i-change-my-mind-after-i-sign-the-loan-closing-documents-for-my-second-mortgage-or-refinance-what-is-the-right-of-rescission-en-186/",
    "topic": "Mortgages",
    "title": "Can I change my mind after I sign the loan closing documents for my second mortgage or refinance? What is the \"right of rescission?\"",
    "last_reviewed": "AUG 08, 2024",
    "language": "English",
    "main_content": "You have the right to cancel, also known as the right of rescission, for most non-purchase money mortgages. A non-purchase money mortgage is a mortgage that is not used to buy the home. Refinances and home equity loans are examples of non-purchase money mortgages.This right gives you three business days to cancel a non-purchase money mortgage agreement. In this case, business days include Saturdays, but not Sundays or legal public holidays.The three-day clock does not start until all three of the following events have happened:You sign the credit contract (usually known as the Promissory Note)You receive the appropriate and accurate Truth in Lending disclosure (in most circumstances, this will be your Closing Disclosure form)You receive two copies of a notice explaining your right to rescindIf you decide you want to rescind a non-purchase money mortgage:You must notify your lender in writing that you are cancelling the loan contract and exercising your right to rescind. You may use the form provided to you by your lender or a letter.You can't rescind just by calling or visiting the lender.Within 20 calendar days after your lender receives your notice of rescission, all money or property you paid as part of the mortgage transaction must be returned to you.In some cases, if the lender doesn’t give you your Truth-in-Lending disclosure (which in most cases will be a Closing Disclosure) or two copies of the notice of the right to cancel, or if the lender makes certain important mistakes on your Truth-in-Lending disclosure, you may have the right to cancel the loan for up to three years. If you think this may apply to you, you should consult a lawyer right away.Note: If you applied for your mortgage on or after October 3, 2015, in most cases your Truth-in-Lending disclosure will be the Closing Disclosure.Tip: Whatever form of written notice you use, make sure it is delivered or mailed before midnight of the third business day after your closing and keep a copy for yourself.Warning: Your right to rescind doesn't change your obligation to make payments on any of your other loans. If you refinance and then rescind the refinance loan, you will still have to pay the original loan.Tip: If you have the right to rescind, you can cancel your loan in the three-day window for any reason or no reason at all.If you have a problem with your mortgage closing process, you should discuss the issue or matter with your lender. If you’re having issues with your mortgage, you can also submit a complaint to the CFPB online or by calling (855) 411-CFPB (2372). We’ll forward your complaint to the company and work to get you a response. You may also wish to get your own attorney to take a look at your issue or matter.",
    "key_message": "Yes. For certain types of mortgages, after you sign your mortgage closing documents, you may be able to change your mind."
}