{
    "url": "https://www.consumerfinance.gov/ask-cfpb/do-auto-and-homeowners-insurance-companies-share-my-information-about-claims-en-1821/",
    "topic": "Credit Reports and Scores",
    "title": "Do auto and homeowners insurance companies share my information about claims?",
    "last_reviewed": "DEC 31, 2024",
    "language": "English",
    "main_content": "Insurance companies use information in these reports to choose the types of policies they offer you and the premiums you pay.Just like with the big three consumer reporting agencies – Experian, Equifax, and TransUnion – you can get free copies of your reports every 12 months from many of the specialty consumer reporting agencies. Other specialty consumer reporting agencies may charge you a fee for your report.Keep in mind that not every agency will have information on everyone. You have to request the reports individually from each reporting agency. We’ve put together a list of some of these specialty consumer reporting agencies, along with some information about how you can obtain copies of your reports.A consumer reporting agency, including a specialty agency, must also give you a free copy of your consumer report upon request if you have received an “adverse action notice”.If an insurance company turns you down for a homeowners insurance policy based on a consumer report, this is an example of an “adverse action.” The insurance company must provide you with an adverse action notice that includes the name and contact information of the consumer reporting agency from which they got the consumer report. You have the right to get a free report from the consumer reporting agency identified in an adverse action notice. Review the report to see what information the consumer reporting agency has on file about your insurance history. You can then ask for corrections of any errors in the report.Tip:Check your credit reports before you shop for insurance or if you have been denied coverage or offered higher premiums in the past. Review your reports to make sure they do not contain mistakes. If they do, you can ask for corrections of any errors in the report. Learn how to dispute an error on your credit report.",
    "key_message": "Yes. There are specialty consumer reporting agencies that collect and report information about the insurance claims you have made on your property and casualty insurance policies, such as your homeowners and auto policies. They may also collect and report on your driving record."
}