{
    "url": "https://www.consumerfinance.gov/ask-cfpb/does-late-rent-affect-my-credit-score-en-1815/",
    "topic": "Credit Reports and Scores",
    "title": "Does late rent affect my credit score?",
    "last_reviewed": "DEC 31, 2024",
    "language": "English",
    "main_content": "There are also specialty consumer reporting agencies that compile information just for landlords to help them decide whether or not to rent to someone. These agencies collect information such as your name, previous addresses, amount of time at each residence, and payment history records from your past landlords.Just like with the big three consumer reporting agencies, you can get free copies of your reports every 12 months from many of the specialty consumer reporting agencies. Other specialty consumer reporting agencies may charge you a fee for your report. We’ve put together a list of some of these specialty consumer reporting agencies, along with information about how you can obtain copies of your reports. Keep in mind that not every agency will have information about everyone.If a landlord denies your rental application due in full or in part to information on your specialty report, this is called an “adverse action.” The landlord must provide you with an adverse action notice that includes the name and contact information of the consumer reporting agency from which the landlord got the consumer report. If you request it, the consumer reporting agency, including a specialty agency, must then give you a free copy of your consumer report that factored into the decision.Tip:Positive rental payments can help build your credit. If you’d like to have rental payments reported to credit reporting agencies, ask your landlord if they participate in a rental reporting program (often through a rental payment app). Be sure to consider any fees that might be charged for these services.",
    "key_message": "Yes. The big three consumer reporting agencies, Experian, Equifax, and TransUnion, use rental payment and related debt collection information in their credit reports, although the way they handle this information varies."
}