{
    "url": "https://www.consumerfinance.gov/ask-cfpb/does-a-persons-debt-go-away-when-they-die-en-1463/",
    "topic": "Debt Collection",
    "title": "Does a person's debt go away when they die?",
    "last_reviewed": "AUG 02, 2023",
    "language": "English",
    "main_content": "Generally, when a person dies, their money and property will go towards repaying their debt. If there’s no money in their estate, the debts will usually go unpaid.For survivors of deceased loved ones, including spouses, you’re not responsible for their debts unless you shared legal responsibility for repaying as a co-signer, a joint account holder, or if you fall within another exception.If you’re not responsible for a debt, debt collectors may still contact you if you’re a surviving spouse or oversee the estate, but it’s illegal for debt collectors to suggest you’re responsible for paying from your own money. It’s also always illegal for them to harass you about paying the debt.\n  \t\n    \n  \t\n  \t\t  \n    \t\t    When you may be responsible for someone else’s debt\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        You’re not typically responsible for repaying the debt of someone who’s died, unless:You’re a co-signer on a loan with outstanding debtYou’re a joint account holder on a credit card. Note: this is different from an authorized userYou’re a surviving spouse and your state law requires spouses to pay a particular type of debtYou’re the executor or administrator of the deceased person’s estate and your state law requires executors or administrators to pay an outstanding bill out of property that was jointly owned by the surviving and deceased spousesYou’re a surviving spouse and you live in a community property state that requires surviving spouses to use jointly-held property to pay debts of a deceased spouse. These states include Alaska (if a special agreement is signed), Arizona, California, Idaho, Louisiana, Nevada, New Mexico, Texas, Washington, and Wisconsin.If there was no co-signer, joint account holder, or other exception, only the estate of the deceased person owes the debt.\n    \n    \n    \n    \n\n                \n    \t\t    \n  \t\t  \n    \n  \t\t  \n    \t\t    When there is no estate\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        If there is no money or property left in the estate, or the estate can’t pay, the debt will generally not be paid. For example, when state law requires the estate to pay survivors first, there may not be any money left over to pay debts.\n    \n    \n    \n    \n\n                \n    \t\t    \n  \t\t  \n    \n  \t\t  \n    \t\t    How debt collectors can communicate with you about a deceased person’s debt\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        If you’re a surviving spouse or a personal representative, executor, or administrator of a deceased person’s estate, debt collectors can contact you to discuss debts and payments from the estate. However, it’s not legal for them to state or imply that you’re personally responsible for paying the person’s debts from your own assets, unless your situation falls into one of the specific circumstances listed above that would make you legally obligated for the debt.Under the Fair Debt Collection Practices Act (FDCPA), debt collectors may not harass, oppress, or abuse you or any third parties they contact. Even if you’re legally responsible for a debt, you have the right to tell a debt collector to stop contacting you.\n    \n    \n    \n    \n\n                \n    \t\t    \n  \t\t  \n    \n  \t\t  \n    \t\t    Ways to understand whether you’re responsible for the debt\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        Talk with a lawyerIf you have questions about whether you’re responsible for a deceased person’s debts, you may want to talk to a lawyer. To find an attorney, you can contact a lawyer referral service  in your area and ask for a lawyer with experience in consumer law, estate or probate matters, debt collection defense, or the FDCPA.Some attorneys may offer free services or charge a reduced fee. There may also be legal aid offices or legal clinics in your area that will offer their services for free if you meet their criteria. Servicemembers should consult their local JAG office .For older Americans and their caregivers, the Eldercare Locator  also provides trustworthy local support resources, including free legal aid for eligible older adults.Get details in writingDebt collectors are required to provide specific information about a debt during your first communication with them or within 5 days of the first communication. This information is known as a validation notice. If the collector refuses to give you any information about the debt – even though you are a surviving spouse, parent of a deceased minor, or personal representative of the estate – it might be a scam.If you’re having an issue with debt collection, you can submit a complaint with the CFPB.",
    "key_message": "When someone dies, their debts are generally paid out of the money or property left in the estate. If the estate can’t pay it and there’s no one who shared responsibility for the debt, it may go unpaid."
}