{
    "url": "https://www.consumerfinance.gov/ask-cfpb/does-my-credit-score-affect-my-ability-to-get-a-mortgage-loan-or-the-mortgage-rate-i-pay-en-319/",
    "topic": "Credit Reports and Scores",
    "title": "Does my credit score affect my ability to get a mortgage loan or the mortgage rate I pay?",
    "last_reviewed": "DEC 31, 2024",
    "language": "English",
    "main_content": "Your credit report and your credit score are two different things. Your credit score is calculated based on the information in your credit report. Higher scores reflect a better credit history and make you eligible for lower interest rates.You have many different credit scores, and there are many ways to get a credit score. However, most mortgage lenders use FICO scores. Your score can differ depending on which credit reporting company is used, but most mortgage lenders look at scores from all three major credit reporting companies – Equifax, Experian, and TransUnion – and use the middle score for deciding what rate to offer you.Errors on your credit report can reduce your score inappropriately – which could mean a higher interest rate and less money in your pocket – so it is important to check your credit report and correct any errors well before you apply for a loan.Your credit score is only one component of your mortgage lender’s decision, but it’s an important one. Other factors include:Credit reportCredit history with that lenderThe amount of debt you already haveHow much you have in savingsYour total assetsCurrent incomeTip: Don’t apply for a lot of new credit in a short time, especially if you are getting ready to get a mortgage. Doing so may negatively affect your score. Your credit score may decline if you have too many credit accounts. It can also go down if you apply for, or open, many new accounts in a short time. However, when you request your own credit report, or when your existing creditors check your credit report, it should not hurt your score.",
    "key_message": "Your credit score and the information on your credit report determine whether you’ll be able to get a mortgage, and the rate you’ll pay."
}