{
    "url": "https://www.consumerfinance.gov/ask-cfpb/how-can-i-find-the-loan-limit-for-a-conforming-loan-in-my-county-en-1961/",
    "topic": "Mortgages",
    "title": "How can I find the loan limit for a conforming loan in my county?",
    "last_reviewed": "JAN 12, 2024",
    "language": "English",
    "main_content": "To find the conforming loan limit for your county useHUD's tool to check loan limits .To filter for your county:Choose your state from the drop-down menuType in your county, and change the “Limit Type” drop-down to “Fannie/Freddie” Leave all of the other inputs alone Click “send” In the resulting table, the number in the “One-Family” column is the conforming loan limit in your county.Knowing the loan limit is helpful when shopping for homes and negotiating with sellers, so you can know whether a particular home might require you to make a higher down payment or get a jumbo loan instead.A conforming loan is one that can be guaranteed by Fannie Mae or Freddie Mac, also known as the government sponsored enterprises (GSEs). By law, the GSEs are only allowed to guarantee loans up to a certain amount. In most counties, that limit is $766,550 for a single-family home or condo. In some counties where home prices are particularly high, there are higher loan limits. In these high-cost counties the limit can go up to $1,149,825. These loans are known as “conforming jumbo” loans because they are part of the conforming program, but the loan limit is higher.Loan limits are also higher if you are purchasing a home with multiple units (for example, a duplex in where you plan to live in one unit and rent the other unit out). The building must have no more than four units and you must purchase the entire building to be eligible (if you’re buying just one unit in a condo building, the regular loan limits apply). To look up these higher multiple-unit loan limits, follow the instructions above and instead look at the column that corresponds to the number of units (called “families” in the table) that you plan to purchase.",
    "key_message": "You can check the loan limit for a conforming mortgage loan in your county on the Department of Housing and Urban Development (HUD)’s website."
}