{
    "url": "https://www.consumerfinance.gov/ask-cfpb/how-can-i-find-out-whats-in-my-medical-payment-history-en-1837/",
    "topic": "Credit Reports and Scores",
    "title": "How can I find out what’s in my medical payment history?",
    "last_reviewed": "SEP 04, 2020",
    "language": "English",
    "main_content": "Just like with the big three consumer reporting agencies– Experian, Equifax, and TransUnion – you can get free copies of your reports every 12 months from many of the specialty consumer reporting agencies. Keep in mind that not every agency will have information on everyone, and that some consumer reporting agencies may be able to charge you a fee for your report. You have to request the reports individually from each reporting agency. We’ve put together a list of some of these specialty consumer reporting agencies, along with some information about how you can obtain copies of your reports.A consumer reporting agency, including a specialty agency, must also give you a free copy of your consumer report upon request if you have received an “adverse action” notice.Example: Let’s say an insurance company turns you down for a life insurance policy based on a consumer report. This is an example of an “adverse action.” The insurance company must provide you with an “adverse action” notice that includes the name and contact information of the consumer reporting agency from which the insurance company got the consumer report.Tip:You have the right to get a free report from the consumer reporting agency identified in an “adverse action” notice. Review the report to see what information the consumer reporting agency has on file about your medical history. If you spot any errors, you can then ask that they be corrected.Tip:If you have been denied coverage or offered coverage with higher premiums in the past, you should check your reports to make sure they do not contain mistakes.  If they do, you can ask for corrections of any errors in the report.",
    "key_message": "You should contact the consumer reporting agencies that specialize in medical records or payments. These agencies may supply reports on your prescription drug purchase histories, medical conditions, data from your insurance applications, and data from other sources. Life insurance companies, for example, commonly use these reports to evaluate policy applications from potential customers."
}