{
    "url": "https://www.consumerfinance.gov/ask-cfpb/how-can-i-figure-out-if-i-can-afford-to-buy-a-home-and-take-out-a-mortgage-en-118/",
    "topic": "Mortgages",
    "title": "How can I figure out if I can afford to buy a home and take out a mortgage?",
    "last_reviewed": "JUN 27, 2024",
    "language": "English",
    "main_content": "Lenders will often tell you how much you are qualified to borrow – that is, how much they are willing to loan you. Several online calculators will compare your income and debts and come up with similar answers based on standard ratios. But how much you could borrow is very different from how much you can afford to repay without stretching your budget for other important items too thin. Lenders do not take into account all your family and financial circumstances.To know how much you can afford to repay, you’ll need to take a hard look at your family’s income, expenses and savings priorities to see what fits comfortably within your budget. Also, remember that your monthly payment could change in the future, depending on what type of mortgage loan you have. Consider how future, higher mortgage payments will fit in with your budget.Don’t forget other mortgage- and home-related costs when determining your ideal payment. Homeowner’s insurance, property taxes, and possibly private mortgage insurance or homeowners association fees are typically added to your monthly mortgage payment, so be sure to include these costs when calculating how much you can afford. There may also be costs for repairs and maintenance of your home. You can get estimates from your insurance agent, local tax assessor, homeowners association, and lender. Knowing how much you can comfortably pay each month will also help you estimate a reasonable price range for your new home.Don’t sacrifice savings in order to buy a bigger house. When reviewing your budget to determine an affordable mortgage payment, don’t forget about your savings. You likely will still need to save for emergencies, retirement, college for the children, and other priorities even after you’re a homeowner. Consider adding more money to your emergency fund or household fund to avoid going into debt to pay for sudden repairs, expensive replacements, or other necessities.Some home-related costs are likely to rise over time. Consider using a tool to estimate the disaster risk of a home and think about how this may impact the future availability and cost of homeowner’s insurance. If you are located in or near a high-risk flood area, you may also be required or opt to buy flood insurance at additional cost. Building codes and energy efficiency can also affect a home’s utility and insurance costs.",
    "key_message": "Focus on a mortgage that is affordable for you given your other priorities, not how much you qualify for."
}