{
    "url": "https://www.consumerfinance.gov/ask-cfpb/how-are-prepaid-cards-debit-cards-and-credit-cards-different-en-433/",
    "topic": "Prepaid cards and other prepaid accounts",
    "title": "How are prepaid cards, debit cards, and credit cards different?",
    "last_reviewed": "OCT 19, 2023",
    "language": "English",
    "main_content": "How do prepaid cards compare to debit cards?\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        A prepaid card is not linked to a bank or credit union account. Instead, you put money into the card account, sometimes called loading money onto the card, before you can spend it. With a debit card, you are spending money you have in your bank or credit union account.Generally, with prepaid cards and debit cards, you can’t spend more than you have loaded on the card or than you have in your account. If you try to spend more, the transaction is denied. However, some bank and credit union accounts allow you to make overdrafts, and so do some prepaid cards. Overdrafts allow you to overspend, and then you must replace the money. Plus, you have to pay an overdraft fee for each transaction that overdraws your account.\n    \n    \n    \n    \n\n                \n    \t\t    \n  \t\t  \n    \n  \t\t  \n    \t\t    How do prepaid cards and debit cards compare to credit cards?\n    \t\t    \n                \n                  \n\n\n    \n    \n    \n    \n        Prepaid cards and debit cards are very different from credit cards. This can be confusing because both types of cards could show a card network logo, such as Visa, MasterCard, American Express, or Discover. When you use a credit card, you’re borrowing money, and you must repay it on the payment due date. Paying late generally means paying a late fee, and paying less than the full amount means paying interest charges. On the other hand, with a debit or prepaid card, you are withdrawing money you already have in your account. Unless you overdraw your account, you do not need to repay money or pay fees.",
    "key_message": "Prepaid cards and debit cards are ways to spend money you already have. Credit cards are ways to borrow money."
}